# PyTutorial 3.2 - Filtering

In this module, we will learn how to use Conditionals to Filter Rows and Columns.

In [93]:
import pandas as pd

people = { "first": ["Ben", "Han", "Luke", "Anakin", "Leia", "Chew", "Master"], 
"last": ["Kenobi", "Solo", "Skywalker", "Skywalker", "Organa", "Bacca", "Yoda"], 
"email": ["Benkenobi@email.com", "Hansolo@email.com", "Lukeskywalker@email.com", "Anakinskywalker@vader.com", "Leiaorgana@email.com", "Chewbacca@email.com", "Masteryoda@force.com"], "salary": ["10000", "7000", "200000", "1000000","8000", "5000", "2000000"], "planet": ["Stewjon", "Corellia", "Tatooine", "Tatooine", "Alderaan", "Kashyyyk", "Dagobah"]}
df = pd.DataFrame(people)
df

    first       last                      email   salary    planet
0     Ben     Kenobi        Benkenobi@email.com    10000   Stewjon
1     Han       Solo          Hansolo@email.com     7000  Corellia
2    Luke  Skywalker    Lukeskywalker@email.com   200000  Tatooine
3  Anakin  Skywalker  Anakinskywalker@vader.com  1000000  Tatooine
4    Leia     Organa       Leiaorgana@email.com     8000  Alderaan
5    Chew      Bacca        Chewbacca@email.com     5000  Kashyyyk
6  Master       Yoda       Masteryoda@force.com  2000000   Dagobah

In [57]:
#Say you want to find two people with the same last name, this is how you would filter it.
df['last'] == 'Skywalker'

0    False
1    False
2     True
3     True
4    False
5    False
6    False
Name: last, dtype: bool

After running it, you get back a series object. The true values are the rows that met our filter criteria. Now you can aplly this filter to your data frame. I', going to create a variable called "filt"

In [58]:
filt = df['last'] == "Skywalker"
df[filt]
#This returns all the rows that have the last name "Skywalker"

    first       last                      email   salary
2    Luke  Skywalker    Lukeskywalker@email.com   200000
3  Anakin  Skywalker  Anakinskywalker@vader.com  1000000

In [59]:
#You can also do:
df[df["last"] == "Skywalker"]
#It gaves you the same results as the method we used above.

    first       last                      email   salary
2    Luke  Skywalker    Lukeskywalker@email.com   200000
3  Anakin  Skywalker  Anakinskywalker@vader.com  1000000

In [60]:
#Lastly, we cause df.loc, which we used in the last tutorial. It will also give you the same results.
df.loc[filt]

    first       last                      email   salary
2    Luke  Skywalker    Lukeskywalker@email.com   200000
3  Anakin  Skywalker  Anakinskywalker@vader.com  1000000

In [71]:
#If you're trying to find another column, you can add it in to the previous code.
df.loc[filt, "email"]

2    Lukeskywalker@email.com
Name: email, dtype: object

In [69]:
#If there are two filters you want to use, you can add t'em both into the filt function.
filt = (df['last'] == 'Skywalker') & (df['first'] == 'Luke')
df.loc[filt, 'email']

2    Lukeskywalker@email.com
Name: email, dtype: object

In [95]:
#Here is how you can make a list to filter out the planets/ one of your columns.
planets = ["Tatooine", "Alderaan", "Dagobah"] #list of planets
filt = df["planet"].isin(planets) #creating a filter
df.loc[filt, "planet"]

2    Tatooine
3    Tatooine
4    Alderaan
6     Dagobah
Name: planet, dtype: object

We can use the string method in Pandas to make alterations to our data frame.

Say you had a data frame where a column named "Codinglanguage" had multiple answers. For this example, we're going to say the answers are: Python,Java,Vs and HTML. If you're trying to filter out Python, you can use contains. It would look like this: 

        #filt = df["Codinglanguage"].str.contains("Python", na=False) 
        df.loc[filt, "Codinglanguage"]

This is saying for this column(Codinglanguage), does the string in that column contain "PYTHON"
All of the answers you'd get back would contain python.